<?php
############# 线路 #############
# 一号线与八通线合并
$subway[1] = explode(',', '苹果园,古城路,八角游乐园,八宝山,玉泉路,五棵松,万寿路,公主坟,军事博物馆,木樨地,南礼士路,复兴门,西单,天安门西,天安门东,王府井,东单,建国门,永安里,国贸,大望路,四惠,四惠东,高碑店,传媒大学,双桥,管庄,八里桥,通州北苑,果园,九棵树,梨园,临河里,土桥');
# 二号线
$subway[2] = explode(',', '积水潭,西直门,车公庄,阜成门,复兴门,长椿街,宣武门,和平门,前门,崇文门,北京站,建国门,朝阳门,东四十条,东直门,雍和宫,安定门站,鼓楼');
# 四号线与大兴线合并
$subway[4] = explode(',', '天宫院,生物医药基地,义和庄,黄村火车站,黄村西大街,清源路,枣园,高米店南,高米店北,西红门,新宫,公益西桥,角门西,马家堡,北京南站,陶然亭,菜市口,宣武门,西单,灵境胡同,西四,平安里,新街口,西直门,动物园,国家图书馆,魏公村,人民大学,海淀黄庄,中关村,北京大学东门,圆明园,西苑,北宫门,安河桥北');
# 五号线与亦庄线合并
$subway[5] = explode(',', '天通苑北,天通苑,天通苑南,立水桥,立水桥南,北苑路北,大屯路东,惠新西街北口,惠新西街南口,和平西桥,和平里北街,雍和宫,北新桥,张自忠路,东四,灯市口,东单,崇文门,磁器口,天坛东门,蒲黄榆,刘家窑,宋家庄,肖村,小红门,旧宫,亦庄桥,亦庄文化园,万源街,荣京东街,荣昌东街,同济南路,经海路,次渠南,次渠');
# 八号线
$subway[8] = explode(',', '森林公园南门,奥林匹克公园,奥体中心,北土城');
# 十号线
$subway[10] = explode(',', '巴沟,苏州街,海淀黄庄,知春里,知春路,西土城,牡丹园,建德门,北土城,安贞门,惠新西街南口,芍药居,太阳宫,三元桥,亮马桥,农业展览馆,团结湖,呼家楼,金台夕照,国贸,双井,劲松');
# 十三号线
$subway[13] = explode(',', '西直门,大钟寺,知春路,五道口,上地,西二旗,龙泽,回龙观,霍营,立水桥,北苑,望京西,芍药居,光熙门,柳芳,东直门');
# 十五号线
$subway[15] = explode(',', '望京西,望京,崔各庄,马泉营,孙河,国展,花梨坟,后沙峪');
# 昌平线
$subway[98] = explode(',', '西二旗,生命科学园,朱莘庄,巩华庄,沙河,沙河高教园,南邵');
# 机场线
$subway[99] = explode(',', '东直门,三元桥,首都机场');

############# 换乘 #############
$transfers['复兴门'] = array(
	1, 
	2
);
$transfers['西直门'] = array(
	2, 
	4, 
	13
);
$transfers['宣武门'] = array(
	2, 
	4
);
$transfers['崇文门'] = array(
	2, 
	5
);
$transfers['建国门'] = array(
	1, 
	2
);
$transfers['东直门'] = array(
	2, 
	13, 
	99
);
$transfers['雍和宫'] = array(
	2, 
	5
);
$transfers['国贸'] = array(
	1, 
	10
);
$transfers['三元桥'] = array(
	10, 
	99
);
$transfers['芍药居'] = array(
	10, 
	13
);
$transfers['惠新西街南口'] = array(
	5, 
	10
);
$transfers['北土城'] = array(
	8, 
	10
);
$transfers['知春路'] = array(
	10, 
	13
);
$transfers['海淀黄庄'] = array(
	4, 
	10
);
$transfers['西二旗'] = array(
	13, 
	98
);
$transfers['望京西'] = array(
	13, 
	15
);
$transfers['东单'] = array(
	1, 
	5
);
$transfers['西单'] = array(
	1, 
	4
);
$transfers['立水桥'] = array(
	5, 
	13
);

// 环线
$loopLines = array(
	'2'
);